In [3]:
import pandas as pd #Chamando a biblioteca pandas

In [4]:
tabela = pd.read_csv('../../data/aulas/Matriculados.csv') #Lendo o arquivo CSV

In [5]:
tabela.head() #Visualizando as cinco primeiras linhas

    nome  idade  peso  altura sexo
0  Maria     20    71    1.64    F
1  Pedro      8    33    1.20    M
2  Pablo     46    90    1.90    M
3  Joana     83    58    1.54    F

In [7]:
tabela['nome'] #Visualizando a coluna nome

0    Maria
1    Pedro
2    Pablo
3    Joana
Name: nome, dtype: object

In [8]:
colunas = ['nome', 'peso'] #Chamando apenas as colunas nome e peso

In [9]:
colunas #Vendo quais colunas

['nome', 'peso']

In [10]:
tabela[colunas] #Visualizando apenas as colunas selecionadas

    nome  peso
0  Maria    71
1  Pedro    33
2  Pablo    90
3  Joana    58

In [11]:
tabela.iloc[:,:]

    nome  idade  peso  altura sexo
0  Maria     20    71    1.64    F
1  Pedro      8    33    1.20    M
2  Pablo     46    90    1.90    M
3  Joana     83    58    1.54    F

In [12]:
tabela.iloc[1:,:] #Filtrando apartir da linha 1 até o final

    nome  idade  peso  altura sexo
1  Pedro      8    33    1.20    M
2  Pablo     46    90    1.90    M
3  Joana     83    58    1.54    F

In [13]:
tabela.iloc[1:3,:] #Filtrando da linha 1 até a 2 (a linha 3 não será mostrada)

    nome  idade  peso  altura sexo
1  Pedro      8    33     1.2    M
2  Pablo     46    90     1.9    M

In [14]:
tabela.iloc[1:2,:] #Filtrando da linha 1 a linha 2

    nome  idade  peso  altura sexo
1  Pedro      8    33     1.2    M

In [15]:
tabela.iloc[2:,:] #Filtrando apartir da linha 2 até o fim

    nome  idade  peso  altura sexo
2  Pablo     46    90    1.90    M
3  Joana     83    58    1.54    F

In [17]:
tabela.iloc[:,:3] #Filtrando até a coluna 3

    nome  idade  peso
0  Maria     20    71
1  Pedro      8    33
2  Pablo     46    90
3  Joana     83    58

In [19]:
tabela.iloc[1:3,1:3] #Filtrando da linha 1 até linha 3, e coluna 1 a coluna 3

   idade  peso
1      8    33
2     46    90

In [20]:
n_filhos = [0, 0, 1, 2] #Criando nova coluna

In [21]:
n_filhos #Visualizando a coluna criada

[0, 0, 1, 2]

In [22]:
tabela['n_filhos'] = n_filhos  #Adicionando coluna 
tabela.head()                  #Visualizando tabela

    nome  idade  peso  altura sexo  n_filhos
0  Maria     20    71    1.64    F         0
1  Pedro      8    33    1.20    M         0
2  Pablo     46    90    1.90    M         1
3  Joana     83    58    1.54    F         2

In [23]:
tabela.drop(['n_filhos'], axis=0) #Deletando coluna criada, axis=0 pega a linha, não a coluna pos isso o erro.

<class 'KeyError'>: "['n_filhos'] not found in axis"

In [24]:
tabela.drop(['n_filhos'], axis=1) #Deletando a coluna, axis=0 pega a coluna

    nome  idade  peso  altura sexo
0  Maria     20    71    1.64    F
1  Pedro      8    33    1.20    M
2  Pablo     46    90    1.90    M
3  Joana     83    58    1.54    F

In [25]:
tabela.head() #Visualizando a tabela, após deletar a coluna ainda consta na coluna

    nome  idade  peso  altura sexo  n_filhos
0  Maria     20    71    1.64    F         0
1  Pedro      8    33    1.20    M         0
2  Pablo     46    90    1.90    M         1
3  Joana     83    58    1.54    F         2

In [27]:
tabela2 = tabela.drop(['n_filhos'], axis=1) #Criando outra tabela, a coluna não aparece 
tabela2.head()

    nome  idade  peso  altura sexo
0  Maria     20    71    1.64    F
1  Pedro      8    33    1.20    M
2  Pablo     46    90    1.90    M
3  Joana     83    58    1.54    F

In [28]:
tabela.drop(['n_filhos'], axis=1, inplace=True) #Deletando a coluna, adicionado o inplace=True, a coluna soma dessa tabela, sem a necessiadade de criar outra
tabela.head()

    nome  idade  peso  altura sexo
0  Maria     20    71    1.64    F
1  Pedro      8    33    1.20    M
2  Pablo     46    90    1.90    M
3  Joana     83    58    1.54    F